# Homework 2: Pandas


Homework 2 is out, it is notebook form. You need to fill in the answers in the cells and produce graphs. Everything needed for the assignment is explained in the notebook. 

**How to submit**

You need to send the `.ipynb` file with your answers plus an `.html` file, which will serve as a backup for us in case the `.ipynb` file cannot be opened on my or the TA's computer. 

The homework solution should be uploaded on e-campus. You can submit it as often as you like before the deadline.

**Important**

- Please make sure that you provide an answer in each cell and place that contains the **[ your answer ]** tags.
- The places that require your code answer are marked with `"# YOUR CODE"` comments.
- Note that you may use 1 or more line of code for replacing each `"# YOUR CODE"` comment.

In [25]:
%matplotlib inline
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import pandas as pd

# Pandas Basics (40 points)

Consider the series s of letters in a sentence

In [26]:
s = pd.Series(list("Series is a one-dimensional labeled array capable of holding any data type (integers, strings, floating point numbers, Python objects, etc.). The axis labels are collectively referred to as the index."))

## Question 1a

What is count of each letter in the sentence, output a series which is sorted by the count?

In [27]:
#YOUR CODE HERE
s.value_counts()

     29
e    23
a    15
i    12
n    12
t    12
l    11
s    11
o    10
r    10
d     6
b     5
y     5
c     5
g     4
,     4
h     4
f     3
p     3
.     3
x     2
m     2
S     1
-     1
(     1
P     1
u     1
j     1
)     1
T     1
v     1
Name: count, dtype: int64

## Question 1b

Create a list with only the top 5 common letters (not including space)

In [28]:
#YOUR CODE HERE
s[s!=' '].head().tolist()

['S', 'e', 'r', 'i', 'e']

Given the dataframe below,

In [29]:
dates = pd.date_range('1/1/2000', periods=8)
df = pd.DataFrame(np.random.randn(8, 4), index=dates, columns=['A', 'B', 'C','D'])
df

                   A         B         C         D
2000-01-01 -0.906421  0.032115 -0.352722 -0.042220
2000-01-02 -1.384463  0.690163 -0.450931 -0.504544
2000-01-03 -1.256912 -2.229694  0.564801  0.390771
2000-01-04  0.805044  0.349354 -0.073945 -0.161314
2000-01-05 -0.998308  2.268200 -0.423632 -1.272455
2000-01-06 -0.982074 -0.361562 -1.718609 -1.268762
2000-01-07  0.745164  0.584704  0.479699  0.021960
2000-01-08  1.179825 -0.591407 -0.311564  0.630561

## Question 1c

Find last two rows of columns A and D

In [30]:
#YOUR CODE HERE
df.iloc[-2:, [0, 3]]

                   A         D
2000-01-07  0.745164  0.021960
2000-01-08  1.179825  0.630561

## Question 1d

Find last three rows which satisfy that column A > Column B

In [31]:
#YOUR CODE HERE
df[df['A'] >= df['C']].tail(3)

                   A         B         C         D
2000-01-06 -0.982074 -0.361562 -1.718609 -1.268762
2000-01-07  0.745164  0.584704  0.479699  0.021960
2000-01-08  1.179825 -0.591407 -0.311564  0.630561

# Baby Names Questions (30 points)

In [32]:
import urllib.request
import os.path
import zipfile

data_url = "https://www.ssa.gov/oact/babynames/state/namesbystate.zip"
local_filename = "babynamesbystate.zip"
if not os.path.exists(local_filename): # if the data exists don't download again
    with urllib.request.urlopen(data_url) as resp, open(local_filename, 'wb') as f:
        f.write(resp.read())

zf = zipfile.ZipFile(local_filename, 'r')

ca_name = 'NY.TXT'
field_names = ['State', 'Sex', 'Year', 'Name', 'Count']
with zf.open(ca_name) as fh:
    babynames = pd.read_csv(fh, header=None, names=field_names)

babynames.sample(5)

       State Sex  Year      Name  Count
191636    NY   M  1942  Frederic     59
257260    NY   M  1998     Dovid     19
237871    NY   M  1986    Adolfo      7
24369     NY   F  1943   Estelle     72
280806    NY   M  2010     Aedan     18

## Question 2a

Write a line of code that creates a list (or Series or array) of all names that end with “ert”.

Your list should have only one instance of each name!

In [33]:
#YOUR CODE HERE
babynames.loc[babynames['Name'].str.endswith('ert'), 'Name'].unique()

array(['Robert', 'Albert', 'Herbert', 'Gilbert', 'Bert', 'Hubert',
       'Elbert', 'Wilbert', 'Norbert', 'Delbert', 'Adelbert', 'Rupert',
       'Egbert', 'Humbert', 'Ethelbert', 'Lambert', 'Calvert',
       'Engelbert', 'Mert'], dtype=object)

## Question 2b

Find the number of babies born in each year of each sex.

First, build a table showing the total number of babies born of each sex in each year. One way is to groupby using both columns of interest.

In [34]:
#YOUR CODE HERE
babynames.groupby(['Year', 'Sex'])[['Count']].sum()

          Count
Year Sex
1910 F    32428
     M    15720
1911 F    37180
     M    23621
1912 F    49386
...         ...
2017 M    97382
2018 F    86482
     M    95489
2019 F    84372
     M    92912

[220 rows x 1 columns]

## Question 2c

Second, a more natural approach is to use a pivot table. Create a pivot table.

In [35]:
#YOUR CODE HERE
babynames.pivot_table(index='Year', columns='Sex', values='Count', aggfunc='sum')

Sex       F       M
Year
1910  32428   15720
1911  37180   23621
1912  49386   42659
1913  55057   48276
1914  73320   63519
...     ...     ...
2015  91205  102749
2016  89737   99870
2017  87851   97382
2018  86482   95489
2019  84372   92912

[110 rows x 2 columns]

# Enrollment Practice Questions (40 points)

In [36]:
df = pd.read_csv("enrollments.csv", usecols=["Term", "Subject", "Number", "Title", "Enrollment Cnt", "Instructor"])
df.head()

,Term,Subject,Number,Title,Instructor,Enrollment Cnt
0,2018 Spring,Computer Science,9A,Programmers' Matlab,Carol Marshall; Paul Hilfinger,8
1,2018 Spring,Computer Science,9C,Programmers' C,Carol Marshall; Paul Hilfinger,11
2,2018 Spring,Computer Science,9E,Productive Unix Use,Carol Marshall; Paul Hilfinger,36
3,2018 Spring,Computer Science,9F,Programmers' C++,Carol Marshall; Paul Hilfinger,33
4,2018 Spring,Computer Science,9G,Programmers' Java,Carol Marshall; Paul Hilfinger,11

## Question 3a

Try to find all Spring offerings of this course. Note, this dataset only contains Spring offerings, so there's no need to filter based on semester. The official "Number" for this class is "C100".

In [41]:
#YOUR CODE HERE
df[df['Number'] == 'C100']

,Term,Subject,Number,Title,Instructor,Enrollment Cnt
20,2018 Spring,Computer Science,C100,Princ&Tech Data Sci,Fernando Perez; Joseph Gonzalez,610
387,2017 Spring,Computer Science,C100,Princ&Tech Data Sci,Bin Yu; Deborah Nolan; Joseph Gonzalez; Joseph...,67
670,2017 Spring,Statistics,C100,Princ&Tech Data Sci,Bin Yu; Deborah Nolan; Joseph Gonzalez; Joseph...,28

## Question 3b

Create a series where each row correspond to one subject (e.g. English), and each value corresponds to the average number of students for courses in that subject. For example, your series might have a row saying that the average number of students in a Computer Science class is 88.

In [ ]:
#YOUR CODE HERE
df.groupby('Subject')[["Enrollment Cnt"]].mean()

                               Enrollment Cnt
Subject
Computer Science                    88.073620
Electrical Eng & Computer Sci       21.333333
Electrical Engineering              36.339426
English                             24.386286
Philosophy                          41.516949
Statistics                          60.301724

## Question 3c

Create a multi-indexed series where each row corresponds to one subject (e.g. English) offered during one semester (e.g. Spring 2017), and each value corresponds to the maximum number of students for courses in that subject during that semester. For example, you might have a row saying that the maximum number of students in a computer science course during Spring 2012 was 575.

In [52]:
#YOUR CODE HERE
df.groupby(['Term', 'Subject'])[["Enrollment Cnt"]].max()

                                           Enrollment Cnt
Term        Subject
2012 Spring Computer Science                          575
            Electrical Engineering                    204
            English                                   156
            Philosophy                                160
            Statistics                                316
2013 Spring Computer Science                          529
            Electrical Engineering                    238
            English                                   160
            Philosophy                                187
            Statistics                                285
2014 Spring Computer Science                          944
            Electrical Engineering                    384
            English                                   109
            Philosophy                                172
            Statistics                                299
2015 Spring Computer Science                          981
            Electrical Engineering                    383
            English                                   120
            Philosophy                                197
            Statistics                                444
2016 Spring Computer Science                         1156
            Electrical Eng & Computer Sci              18
            Electrical Engineering                    698
            English                                   103
            Philosophy                                200
            Statistics                                450
2017 Spring Computer Science                         1328
            Electrical Eng & Computer Sci              30
            Electrical Engineering                    775
            English                                   141
            Philosophy                                242
            Statistics                                393
2018 Spring Computer Science                         1379
            Electrical Eng & Computer Sci             237
            Electrical Engineering                    825
            English                                   106
            Philosophy                                236
            Statistics                               1043

## Question 3d

Try to compute the size of the largest class ever taught by each instructor. This challenge is stated more vaguely on purpose. You'll have to decide what the data structure looks like. Your result should be sorted in decreasing order of class size.

In [72]:
#YOUR CODE HERE
df.groupby(['Instructor'])['Enrollment Cnt'].max().sort_values(ascending=False)

Instructor
Joshua Hug                                    1379
Joshua Hug; Joshua Hug                        1328
John DeNero                                   1210
Anindita Adhikari; Scott Lee                  1043
John Denero                                    981
                                              ...
Michael Clancy                                   1
Robert Full                                      1
Robert Dudley; Robert Full; Ronald Fearing       1
Rajarshi Mukherjee                               1
Christopher Kutz                                 1
Name: Enrollment Cnt, Length: 745, dtype: int64